-- 데이터베이스 선택
USE dbproject;

INSERT INTO College (단과대학명) VALUES 
('의과대학'), 
('자연과학대학'),
('인문사회과학대학'),
('글로벌경영대학'),
('공과대학'),
('SW융합대학'),
('의료과학대학'),
('SCH미디어랩스'),
('향설나눔대학'),
('창의라이프대학'),
('엔터프라이즈 스쿨');

INSERT INTO Department (학과명, 단과대학ID) VALUES 
('의예과', 1), ('의학과', 1), ('간호학과', 1), ('기초의학교실', 1), ('인문사회의학교실', 1),
('화학과', 2), ('식품영양학과', 2), ('한경보건학과', 2), ('생명과학과', 2), ('스포츠과학과', 2), ('사회체육학과', 2), ('스포츠의학과', 2),
('유아교육과', 3), ('특수교육과', 3), ('청소년교육상담학과', 3), ('법학과', 3), ('행정학과', 3), ('경찰행정학과', 3), ('사회복지학과', 3),
('경영학과', 4), ('국제통상학과', 4), ('관광경영학과', 4), ('경제금융학과', 4), ('IT금융경영학과', 4), ('글로벌문화산업학과', 4), ('회계학과', 4), ('GBS', 4),
('컴퓨터공학과', 5), ('정보통신공학과', 5), ('전자공학과', 5), ('전기공학과', 5), ('전자정보공학과', 5), ('나노화학공학과', 5), ('에너지환경공학과', 5), ('디스플레이신소재공학과', 5), ('기계공학과', 5),
('컴퓨터소프트웨어공학과', 6), ('정보보호학과', 6), ('의료IT공학과', 6), ('AI빅데이터학과', 6), ('사물인터넷학과', 6), ('메타버스&게임학과', 6),
('한국문화콘텐츠학과', 8), ('영미학과', 8), ('중국학과', 8), ('미디어커뮤니케이션학과', 8), ('건축학과', 8), ('디지털애니메이션학과', 8), ('스마트자동차학과', 8), ('에너지공학과', 8), ('공연영상학과', 8), ('탄소중립학과', 8), ('의생명융합학부헬스케어융합전공', 8), ('의생명융합학부바이오의약전공', 8), ('SCH미디어랩스', 8),
('스마트팩토리공학과', 10), ('스마트모빌리티공학과', 10), ('융합바이오공학과', 10), ('산업경영공학과', 10), ('세무회계학과', 10), ('자동차산업공학과', 10), ('융합기계학과', 10), ('신뢰성품질공학과', 10), ('화학공학과', 10), ('메카트로닉스공학과', 10), ('조기취업형 계약학과 사업단', 10), ('일학습병행사업단', 10), ('평생교육원', 10), ('창의라이프대학', 10);


-- 사용자
INSERT INTO User (학번, 비밀번호, 이름, 이메일, 이메일인증여부, 이메일인증코드, 관리자승인여부, 학과ID, 학년, 전학기학점, 역할) VALUES
('20214045', 'hashedpassword1', '홍길동', 'student01@example.com', 1, NULL, '승인', 39, 3, 3.8, 'student'),
('20025001', 'hashedpassword2', '김철수', 'professor01@example.com', 1, NULL, '승인', 39, NULL, NULL, 'professor');

-- 강의
INSERT INTO Course (강의번호, 강의명, 강의실, 담당교수, 정원, 영어강의여부, 이수구분, 영역, 학과ID, 학점, 현재인원) VALUES
('10000', '데이터베이스', 'M520', '20025001', 30, FALSE, '전공', '과학기술', 39, 3.0, 0),
('10001', '운영체제', 'M502', '20025001', 40, FALSE, '전공', '과학기술', 39, 3.0, 0);

-- 강의 시간
INSERT INTO CourseTime (강의번호, 요일, 시작교시, 종료교시) VALUES
('10000', '월', '7A', '8A'),
('10000', '수', '2B', '3B'),
('10001', '화', '4A', '5A'),
('10001', '목', '3B', '4B');

-- 수강 신청
INSERT INTO Enroll (학번, 강의번호) VALUES
('20214045', '10000');

-- 빌넣 요청
INSERT INTO ExtraEnroll (사용자ID, 강의번호, 사유, 상태) VALUES
('20214045', '10001', '꼭 듣고 싶습니다.', '대기');

-- 장바구니
INSERT INTO Cart (사용자ID, 강의번호) VALUES
('20214045', '10001');